In [1]:
import pandas as pd
df=pd.read_csv("car_data.csv")
df.head()

,name,company,year,Price,kms_driven,Unnamed: 5,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007.00,80000.00,45000.00,NaN,Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006.00,425000.00,40.00,NaN,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018.00,Ask For Price,22000.00,NaN,Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014.00,325000.00,28000.00,NaN,Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014.00,575000.00,36000.00,NaN,Diesel

In [2]:
df.tail()

,name,company,year,Price,kms_driven,Unnamed: 5,fuel_type
887,Ta,Tara,zest,310000.00,NaN,NaN,NaN
888,Tata Zest XM Diesel,Tata,2018.00,260000.00,27000.00,NaN,Diesel
889,Mahindra Quanto C8,Mahindra,2013.00,390000.00,40000.00,NaN,Diesel
890,Honda Amaze 1.2 E i VTEC,Honda,2014.00,180000.00,Petrol,NaN,NaN
891,Chevrolet Sail 1.2 LT ABS,Chevrolet,2014.00,160000.00,Petrol,NaN,NaN

In [3]:
df.shape

(892, 7)

In [4]:
df.columns

Index(['name', 'company', 'year', 'Price', 'kms_driven', 'Unnamed: 5',
       'fuel_type'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   Unnamed: 5  0 non-null      float64
 6   fuel_type   837 non-null    object
dtypes: float64(1), object(6)
memory usage: 48.9+ KB

In [6]:
df.isnull().sum()

name            0
company         0
year            0
Price           0
kms_driven     52
Unnamed: 5    892
fuel_type      55
dtype: int64

In [7]:
df['Price']

0           80000.00
1          425000.00
2      Ask For Price
3          325000.00
4          575000.00
           ...
887        310000.00
888        260000.00
889        390000.00
890        180000.00
891        160000.00
Name: Price, Length: 892, dtype: object

In [8]:
df[['Price','year']]

             Price     year
0         80000.00  2007.00
1        425000.00  2006.00
2    Ask For Price  2018.00
3        325000.00  2014.00
4        575000.00  2014.00
..             ...      ...
887      310000.00     zest
888      260000.00  2018.00
889      390000.00  2013.00
890      180000.00  2014.00
891      160000.00  2014.00

[892 rows x 2 columns]

In [9]:

df[['Price','kms_driven']]

             Price kms_driven
0         80000.00   45000.00
1        425000.00      40.00
2    Ask For Price   22000.00
3        325000.00   28000.00
4        575000.00   36000.00
..             ...        ...
887      310000.00        NaN
888      260000.00   27000.00
889      390000.00   40000.00
890      180000.00     Petrol
891      160000.00     Petrol

[892 rows x 2 columns]

In [10]:
df[['name','kms_driven','company']]

                                       name kms_driven    company
0      Hyundai Santro Xing XO eRLX Euro III   45000.00    Hyundai
1                   Mahindra Jeep CL550 MDI      40.00   Mahindra
2                Maruti Suzuki Alto 800 Vxi   22000.00     Maruti
3    Hyundai Grand i10 Magna 1.2 Kappa VTVT   28000.00    Hyundai
4          Ford EcoSport Titanium 1.5L TDCi   36000.00       Ford
..                                      ...        ...        ...
887                                      Ta        NaN       Tara
888                     Tata Zest XM Diesel   27000.00       Tata
889                      Mahindra Quanto C8   40000.00   Mahindra
890                Honda Amaze 1.2 E i VTEC     Petrol      Honda
891               Chevrolet Sail 1.2 LT ABS     Petrol  Chevrolet

[892 rows x 3 columns]

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   Unnamed: 5  0 non-null      float64
 6   fuel_type   837 non-null    object
dtypes: float64(1), object(6)
memory usage: 48.9+ KB

In [12]:
df['Price'] = pd.to_numeric(df['Price'], errors='coerce')
df["Price"]>20000

0       True
1       True
2      False
3       True
4       True
       ...
887     True
888     True
889     True
890     True
891     True
Name: Price, Length: 892, dtype: bool

In [13]:
df['Price'] = pd.to_numeric(df['Price'], errors='coerce')
df['kms_driven'] = pd.to_numeric(df['kms_driven'], errors='coerce')
df.info

<bound method DataFrame.info of                                        name    company     year     Price  \
0      Hyundai Santro Xing XO eRLX Euro III    Hyundai  2007.00   80000.0
1                   Mahindra Jeep CL550 MDI   Mahindra  2006.00  425000.0
2                Maruti Suzuki Alto 800 Vxi     Maruti  2018.00       NaN
3    Hyundai Grand i10 Magna 1.2 Kappa VTVT    Hyundai  2014.00  325000.0
4          Ford EcoSport Titanium 1.5L TDCi       Ford  2014.00  575000.0
..                                      ...        ...      ...       ...
887                                      Ta       Tara     zest  310000.0
888                     Tata Zest XM Diesel       Tata  2018.00  260000.0
889                      Mahindra Quanto C8   Mahindra  2013.00  390000.0
890                Honda Amaze 1.2 E i VTEC      Honda  2014.00  180000.0
891               Chevrolet Sail 1.2 LT ABS  Chevrolet  2014.00  160000.0

     kms_driven  Unnamed: 5 fuel_type
0       45000.0         NaN    Petrol
1          40.0         NaN    Diesel
2       22000.0         NaN    Petrol
3       28000.0         NaN    Petrol
4       36000.0         NaN    Diesel
..          ...         ...       ...
887         NaN         NaN       NaN
888     27000.0         NaN    Diesel
889     40000.0         NaN    Diesel
890         NaN         NaN       NaN
891         NaN         NaN       NaN

[892 rows x 7 columns]>

In [14]:
df[df['Price']>250000]

,name,company,year,Price,kms_driven,Unnamed: 5,fuel_type
1,Mahindra Jeep CL550 MDI,Mahindra,2006.00,425000.0,40.0,NaN,Diesel
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014.00,325000.0,28000.0,NaN,Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014.00,575000.0,36000.0,NaN,Diesel
8,Ford EcoSport Ambiente 1.5L TDCi,Ford,2016.00,830000.0,24530.0,NaN,Diesel
11,Maruti Suzuki Stingray VXi,Maruti,2015.00,315000.0,30000.0,NaN,Petrol
...,...,...,...,...,...,...,...
884,tata zest 2017 f,tata,sale,450000.0,NaN,NaN,NaN
886,Toyota Corolla Altis,Toyota,2009.00,300000.0,132000.0,NaN,Petrol
887,Ta,Tara,zest,310000.0,NaN,NaN,NaN
888,Tata Zest XM Diesel,Tata,2018.00,260000.0,27000.0,NaN,Diesel
889,Mahindra Quanto C8,Mahindra,2013.00,390000.0,40000.0,NaN,Diesel

In [15]:
df['year']=pd.to_numeric(df['year'],errors='coerce')
df[df['year']>2015]

,name,company,year,Price,kms_driven,Unnamed: 5,fuel_type
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018.0,NaN,22000.0,NaN,Petrol
8,Ford EcoSport Ambiente 1.5L TDCi,Ford,2016.0,830000.0,24530.0,NaN,Diesel
16,Audi A8,Audi,2017.0,1000000.0,4000.0,NaN,Petrol
18,Mahindra Scorpio S10,Mahindra,2016.0,350000.0,43000.0,NaN,Diesel
20,Mahindra Scorpio S10,Mahindra,2016.0,350000.0,43000.0,NaN,Diesel
...,...,...,...,...,...,...,...
873,Maruti Suzuki Dzire,Maruti,2016.0,325000.0,150000.0,NaN,Diesel
874,Hyundai Elite i20,Hyundai,2018.0,510000.0,2100.0,NaN,Petrol
875,Honda City VX Petrol,Honda,2016.0,860000.0,95000.0,NaN,Petrol
876,Maruti Suzuki Dzire,Maruti,2016.0,450000.0,2500.0,NaN,Diesel
888,Tata Zest XM Diesel,Tata,2018.0,260000.0,27000.0,NaN,Diesel

In [18]:

df[(df['Price']>50000) & (df['year']>2018)]

,name,company,year,Price,kms_driven,Unnamed: 5,fuel_type
86,Volkswagen Vento Highline Plus 1.5 Diesel AT,Volkswagen,2019.0,1200000.0,3600.0,NaN,Diesel
215,Mahindra Jeep MM 550 XDB,Mahindra,2019.0,390000.0,60.0,NaN,Diesel
220,Mahindra Jeep CL550 MDI,Mahindra,2019.0,379000.0,0.0,NaN,Diesel
302,Maruti Suzuki Swift VXi 1.2 ABS BS IV,Maruti,2019.0,610000.0,73.0,NaN,Petrol
364,Mahindra Jeep MM 550 XDB,Mahindra,2019.0,390000.0,60.0,NaN,Diesel
376,Mahindra Jeep CL550 MDI,Mahindra,2019.0,379000.0,0.0,NaN,Diesel
427,Nissan X Trail Select Variant,Nissan,2019.0,1200000.0,300.0,NaN,Diesel
485,Tata Tigor Revotron XZ,Tata,2019.0,650000.0,100.0,NaN,Diesel
508,Renault Kwid RXT,Renault,2019.0,370000.0,1000.0,NaN,Petrol
544,Hyundai Verna 1.6 SX VTVT AT,Hyundai,2019.0,900000.0,2000.0,NaN,Petrol
568,Maruti Suzuki Alto,Maruti,2019.0,265000.0,9800.0,NaN,Petrol
702,Ford Figo Petrol Titanium,Ford,2019.0,525000.0,0.0,NaN,Petrol
738,Hyundai Creta 1.6 SX,Hyundai,2019.0,1200000.0,0.0,NaN,Petrol
762,Tata Tiago Revotorq XZ,Tata,2019.0,568500.0,0.0,NaN,Petrol
836,Mahindra KUV100 K8 6 STR,Mahindra,2019.0,560000.0,2875.0,NaN,Petrol
838,Ford Endeavor 4x4 Thunder Plus,Ford,2019.0,2900000.0,9000.0,NaN,Diesel
843,Maruti Suzuki Alto 800 Lx,Maruti,2019.0,400000.0,1500.0,NaN,Petrol
847,Maruti Suzuki Alto AX,Maruti,2019.0,425000.0,1625.0,NaN,Petrol

In [19]:
df['kms_driven']=pd.to_numeric(df['kms_driven'],errors='coerce')

In [20]:
df['fuel_type'].value_counts()

Petrol    440
Diesel    395
LPG         2
Name: fuel_type, dtype: int64

In [21]:
df['company'].value_counts()

Maruti        235
Hyundai       145
Mahindra      100
Tata           74
Honda          61
Toyota         39
Chevrolet      35
Renault        34
Ford           31
Volkswagen     20
Skoda          13
Audi           11
Datsun          8
Mini            8
BMW             8
Nissan          6
Commercial      6
Mercedes        6
Mitsubishi      6
Force           4
Fiat            4
tata            3
Hindustan       3
I               3
MARUTI          2
urgent          2
Used            2
Jaguar          2
Sale            2
Well            1
Any             1
TATA            1
sell            1
scratch         1
9               1
7               1
all             1
Land            1
2012            1
i               1
Volvo           1
very            1
Jeep            1
Swift           1
URJENT          1
selling         1
Yamaha          1
Tara            1
Name: company, dtype: int64

In [24]:
df['fuel_type'].value_counts(normalize=True)

Petrol    0.525687
Diesel    0.471924
LPG       0.002389
Name: fuel_type, dtype: float64

In [27]:
df[df['fuel_type']=='Petrol']['Price'].mean()

324181.56775700935

In [28]:
df[df['fuel_type']=='Diesel']['Price'].mean()

509849.3860103627

In [30]:
avg=df['Price'].mean()
df[
    (df['Price'])&
    ()&
    ()
]